---
kind: enumMember
id: F:Autodesk.Revit.DB.CompoundStructureError.VerticalWrongOrderLayer
enum: Autodesk.Revit.DB.CompoundStructureError
source: html/8e8457e0-84c4-ccb1-114c-fa25a6d37fed.htm
---
# Autodesk.Revit.DB.CompoundStructureError.VerticalWrongOrderLayer

Layers assigned to the same Row are not on the same side of the Core Boundary.